[
  {
    "title": "SABI Hackathon - Manila Prime, Second Place",
    "date": "Friday, 19 July 2024",
    "image": "IMG_7021.jpeg",
    "tags": ["hackathon", "analytics", "consulting"],
    "lede": "We walked in as Commissioners with a colony in crisis and almost no time, so we chose ruthless focus: one flagship issue, energy.",
    "body_md": "# The Mission\nWe walked into the SABI hackathon as “Commissioners” with a colony in crisis and almost no time. Manila Prime’s briefing read like a knot: energy instability, food waste, a government stuck in executive only mode, and a budget that had wandered far from the plan. The event wanted more than slogans, it wanted data, logic, and something a panel from Accenture and DLS CSB could actually implement. So we made one ruthless decision early: instead of skimming five problems, we’d go deep on one flagship issue, the beating heart of the entire mess, energy, and we’d thread everything else through it only where it sharpened the point.\n\nThe inputs came at us fast: an executive summary showing GDP decline and lopsided spending; nine testimonies ranging from a reactor head warning about cheap materials to a whistleblower describing zero regulatory boards; and CSVs covering energy, infrastructure, food imports, agriculture, and military outlays. Each source had its own tone, frustrated farmers, exasperated officers, a meticulous captain general calling out constitutional violations, but the story they told overlapped: money had moved, projects hadn’t, and when they had, they’d been patched together with the wrong priorities.\n\nWe framed our hypothesis simply enough to defend under pressure: a big chunk of funds earmarked for renewable energy never became real assets. Executed spend clustered around reactors and grid band aids; non executed spend piled up in renewables. That dynamic left the colony tied to two reactors, long vulnerable lines, and monthly repairs that bled time and money. The testimonies didn’t just support this; they practically shouted it. The Minister of Procurement lamented a performative “green” push that ignored the plan. The reactor plant head explained exactly how “cheaper” materials corroded reliability. Gabriel Titus confessed the vacuum of oversight that let this all slide. Our goal wasn’t to dunk on mismanagement; it was to quantify it, then show a better path.\n\nWe got to work in Colab. First, we cleaned the energy and infrastructure CSVs, nothing fancy, just getting commas out of the numbers and mapping the legend codes: Executed = 1 vs Not Executed = 2; Type = reactor/non renewable vs renewable. Then we asked the most basic question a budget should answer: where did the money go, and did it materialize into assets? We summed spending by execution status and by energy type. The pattern was crystal: a healthy allocation to renewables, but a stubborn “Not Executed” pile that explained why the colony was still limping along on reactors and repairs. We ran a lightweight hypothesis test, less about p values, more about the visible effect size, and it backed the narrative: the allocation to execution conversion was broken.\n\nTo keep the judges oriented, we built three visuals and practiced the story for each. First, a bar chart of Executed vs Not Executed that hit like a headline: “Here’s the money we planned to transform into renewable capacity, and here’s how much didn’t.” Second, a bar chart of Renewable vs Non Renewable spending that showed intent wasn’t the problem, execution was. Third, a simple actual vs predicted scatter using a basic model on the limited features we had (type and execution) to make a point about governance: even a model should do better if the pipeline from budget to asset is consistent; the fact that it didn’t perform perfectly helped us argue for better data disciplines, quality standards, and milestone gating. We were transparent about limits; that honesty mattered.\n\nBecause data without lived context is dead, we anchored each point to a testimony. The reactor head’s letter turned our grid modernization slide from an abstract recommendation into a necessity: “Your lines are failing because the material spec is wrong, and you’re paying for it every month.” The Minister of Procurement’s critique became the spine of our audit plan: “Stop calling it a green push if it never becomes hardware.” Titus’s confession gave us the governance mechanism: independent audits, public dashboards, and milestone based payments so money only moves when outcomes do. Even the admiral’s memo about zero combat risk handed us a polite reallocation lever: trim performative military spend and feed the grid and public transit.\n\nOur solution was phased, specific, and designed to survive politics. In the first 90 days, we proposed a post award audit of every not executed renewable line; cancel or rebid with transparent terms; and start grid modernization, switch to the more robust cable spec, harden prioritized corridors, and roll out smart grid monitoring to shorten fault to fix times. We also pushed for execution gates: clear milestones and acceptance tests before disbursement. In 3 to 9 months, we’d stand up microgrids in the agricultural zones and pair them with solar + storage to break the dependence on long, failure prone transmission; publish a public budget→execution→uptime dashboard; and retire the habit of “repairs forever.” By 9 to 18 months, we’d shift capital from reactive fixes to planned reliability projects, expand demand side efficiency, and bake quality into procurement: vendor prequalification, material spec enforcement, and real QA.\n\nWe did have more ammo in the chamber, food imports showed 80% wastage, the military spreadsheet screamed misalignment with any plausible threat model, and infrastructure listed transit materials “not yet deployed” alongside missing and undeclared lines, but the clock was real. So we kept those as Q&A extensions, always tying them back to the same execution discipline we were advocating in energy: milestone gates, independent audit, public reporting, and evidence based reprioritization. The story stayed coherent no matter which dataset a judge threw at us.\n\nWhy did it land? Because we didn’t try to be clever for its own sake. We quantified a specific failure mode (budget → not executed), connected it to operational pain (outages, repairs, dependency), and offered a doable plan that blended governance and engineering. We were clear about what the model could and couldn’t say with two features; ironically, that strengthened our case for better data capture (line age, outage minutes, distance to load, terrain, weather, failure counts). We narrated the visuals, not just showed them: “This is the money that never became assets. This is why the reactor still carries everything. This is what to fix first.” It read like a consulting deliverable, not a science fair.\n\nAnd so, one crisp problem, three honest visuals, testimonies stitched into the analysis, and an implementation plan you could hand to a PMO, second place. On a longer stage we’d have pulled in food logistics (cold chain, storage, supplier rationalization, local production ramp via your Agri Dev table), defense reallocation, and a transit rollout (that grav train line that’s “not yet deployed”), all under the exact same execution discipline. But the win came from choosing depth over breadth and proving we could turn a noisy brief into a prioritized, data defended path forward.\n\nIf we keep building from here, the next iteration is obvious: improve features (outage metrics, failure hot spots, material inventories), stand up the public dashboard, and show month over month uptime gains as audits clear and microgrids come online. That’s the story Manila Prime needs, and the one we told in five minutes, cleanly enough to take second place.\n\n",
    "facts": ["Event: SABI Hackathon", "Award: 2nd place", "Role: Analyst & presenter", "Judges: Accenture & DLS CSB"]
  },
  {
    "title": "NSTP 02 - AKAP sa Bata",
    "date": "2024",
    "image": "nstp.jpg",
    "tags": ["community", "teaching", "leadership"],
    "lede": "We were 13 students tasked to serve 150 people. In the chaos, I found clarity, and a calling to serve.",
    "body_md": "## What We Built\nWhen NSTP 02 was first introduced to us, I felt the weight of uncertainty. We were told we’d be catering to 50 children and 100 parents, yet we were only a class of just over 15 students, and soon, that number dropped to 13. On paper, we were outnumbered. But what I didn’t know then was that those 13 students would become one of the most passionate, driven, and collaborative groups I’d ever work with. And in that chaos, I would find clarity. Not just in what community service means, but in why I am placed here by Him.\n\nThe program's development was similar to building a house without a blueprint, operating on a limited budget, and relying heavily on intuition and experience. We initially thought about conducting a livelihood seminar on sewing, but I immediately challenged this. A sewing machine is expensive, and beyond the initial novelty of creating \"basahan,\" I worried it lacked lasting value, impact, and usefulness for the parents, especially since this is for their livelihood. I believed that to truly empower someone through business, they need to understand the fundamentals. It was not just about using items or tools, but also about understanding how to use them wisely. So I wanted to propose something simpler, practical, and scalable: costing, more specifically, the 3x rule in pricing. It was a concept I lived by as someone who ran a shoe store and managed a family hardware business in Davao. It was my way of saying, “This is how you begin.”\n\nBudgeting and logistics were, quite literally, intense. As the head of the finance committee, I was hyper aware of every peso spent. We had to stretch omelets in half to feed everyone. Yes, literally! With surgical gloves from the nurse beside us, we found ourselves dividing portions like a surgical team in an operating room. It was ridiculous, hilarious, and oddly beautiful. The little moments of joy amidst the chaos were my favorite part. The laughter over torn omelettes reminded me that even the most \"serious\" outreach programs have space for humanity, laughter, and moments that feel like little wonders.\nI truly believe that the parents of AKAP sa Bata were more than just an audience; they were individuals with dreams, worries, and families. I held a livelihood seminar for them, sharing how business doesn’t have to be overwhelming. I talked about momentum, starting small, walking before running, and the simplicity of the 3x pricing rule. I connected it to my own experiences. I once stumbled through pricing, shipping, and Alibaba forwarding/logistics until I found systems that worked. I wanted them to feel that this world, the world of business, isn’t exclusive or elite. It's something they can enter with excitement, passion, and faith.\n\nAnd to my surprise, they listened. Despite me being younger, they welcomed the knowledge. One parent even shared how she had given up on her business before because it was too time consuming, that it ate up time with her family. But after hearing my talk, she felt that maybe, just maybe, she could try again. That moment stayed with me. It made me realize that the simplest idea can spark the greatest impact.\n\nMy role wasn’t just finance. I was a storyteller, a strategist, and someone who tried to bring heart into every technical detail. I made sure we didn’t just buy things; we bought with purpose. I ensured that no effort was wasted, and even the way we fed our participants came from thoughtful planning. During the seminar, I poured out every business lesson I knew, hoping to bring hope in the minds of parents who had nearly given up.\n\nDespite our teacher being late, I’m just kidding haha! But in all seriousness, Sir Christian was a gift to our team. He guided us without caging us. He led with both professionalism and heart, playing Mobile Legends with us in the bus, even teaching us how to research better as he knew we had our thesis defense coming up, and giving us the freedom to explore ideas while quietly making impactful and powerful things happen behind the scenes. He found our speakers. He opened doors. And above all, he trusted us. That trust empowered us to dream bigger, work harder, and never lose the joy in what we were doing.\n\nI actually feel happy because I took this NSTP class again after failing my first attempt. This is because I didn’t just gain groupmates. I made friends, people I knew by name, whose faces I could smile at in the halls, on the streets, anywhere! NSTP became a space where connection flourished. We weren’t just fulfilling requirements; we were building something real. People like Kynna, Lycah, Luke, Tony, Angela, Skyler, Gavin, Jadon, Coby, Pau, Christian, and Ethan; they weren’t just classmates. They were my co dreamers.\n\nNSTP 02 wasn’t perfect, but it was powerful. It gave us the structure we needed to create something impactful, but it also allowed space for us to be creative, strategic, and most of all, human in the world He created. I wouldn’t change anything, because even the messy parts became meaningful.\n\nThis course made me feel rooted in something greater than myself. I used to think my skills were just for my own dreams, being a data scientist, a business owner, or a strategist. But NSTP showed me that the same skills can be used to lift others, to serve, to bless. Everyone in the group was significant. Each one had a strength, a story, a drive. But Sir Ranche, with his humility and belief in us, was our backbone. He didn’t just manage the course; he cultivated our growth.\n\nI gave my best in every phase. Be it planning, budgeting, or execution. I brought my business background and passion for storytelling into every step, especially the seminar. I felt like I was finally using my life experiences for a greater cause. I started to feel like His instrument.\n\nThis experience reflected Faith, as I surrendered the outcome to God and trusted in the value of kindness. It reflected Zeal for Service, as I gave my heart in a way that could lift others up. And most of all, it reflected Communion in Mission, as we walked together, 13 strong, toward one shared purpose. \n\nThe struggles we experienced in Akap sa Bata reminded me that poverty is not just material; it’s the lack of access, support, belief, and time. But when people are given tools, hope, and care, human dignity begins to rise again. I saw it happen in real time. The Philippines needs more programs like this: grounded, people first, sustainable. Service isn’t about saving; it’s about standing beside, equipping, and believing. I want to keep doing that.\n\nEverything I learned, I’ll carry forward. Whether it’s teaching business, building a company, or mentoring someone, I now know that even my smallest ideas can be someone’s breakthrough. NSTP showed me I don’t have to wait for success to serve; I can do it now.\n\nNSTP wasn’t just a subject. It was a reminder that in a world full of people waiting for miracles, sometimes we are the ones sent to be the miracles. Amidst all experiences, this thought recurs in my mind:\n\n\"Perhaps the very reason you are where you are, with all that you’ve gone through… is because God needed someone like you, right there, to be His instrument.\"\n\nAnd I say this now, with full certainty: “I’m Vin, and I’m happy to be His.”\n\n\n",
    "facts": ["Role: Finance head & livelihood speaker", "Focus: 3× pricing rule, simple startup economics", "Partner: AKAP sa Bata", "Outcome: Parents re-engaged with their small businesses"]
  }
]