[
  {
    "title": "SABI Hackathon - Manila Prime, Second Place",
    "date": "Friday, 19 July 2024",
    "image": "IMG_7021.jpeg",
    "tags": ["hackathon", "analytics", "consulting"],
    "lede": "We walked in as Commissioners with a colony in crisis and almost no time, so we chose ruthless focus: one flagship issue, energy.",
    "body_md": "# The Mission\nAt the SABI Hackathon, we were chosen as “Commissioners” to help Manila Prime, a fictional futuristic colony that was facing serious problems. The story we walked into? The colony was struggling with blackouts, food waste, missing infrastructure, and an out of control budget. We had to act fast. Instead of trying to fix everything, we focused on just one major problem: energy, because if the power grid fails, everything else crumbles with it.\n\nOur mission was clear: dig through the data, find out what is really going wrong, and pitch a realistic plan that could actually be implemented. We received different forms of information: financial summaries, testimonies from officials and citizens, and spreadsheets with raw data about energy projects, infrastructure, food, agriculture, and military spending. One message kept showing up: money was being spent, but the outcomes were not. Renewable energy projects were not getting built, while fragile reactor systems were overused and failing. People were frustrated, and we needed to connect the dots.\n\nWe started by looking at the Energy CSV file, which listed every project, its budget, and whether it was executed or not. We saw that a lot of the money meant for renewable energy was not actually being used; the projects were never completed. Meanwhile, most of the completed projects were still focused on old reactors and patchwork fixes to the grid. So the colony remained heavily dependent on two reactors and was spending a lot on constant repairs. This matched the testimonies from a reactor engineer, the minister of procurement, and a whistleblower who exposed poor materials and zero regulation.\n\nWe kept things simple in our analysis. We cleaned the data, checked where the money went, and visualized how much was “executed” versus “not executed.” The story was clear: renewable energy was funded, but not finished. We also made a small prediction model to show that even a basic tool struggled to understand how spending was behaving; not because the model was bad, but because the government was not following a clear pattern. This proved our point: without good governance and execution, even the best budget or technology will not work.\n\nWe proposed a 3 phase plan that was honest, actionable, and tailored to the real problem. In the first 90 days: audit the failed renewable projects, cancel the bad ones, and prioritize grid repairs using quality materials. In the next 3 to 9 months: build microgrids in rural areas using solar and batteries, and publish a public dashboard to track progress. In 9 to 18 months: shift away from endless repairs and instead plan long term energy reliability, while making sure vendors meet quality standards.\n\nEven though we only had time to present this one issue, we showed how energy mismanagement connected to the other problems too; food wastage, military overspending, and missing infrastructure were all tied to the same issue: poor execution. Our clarity, visuals, data, and phased plan impressed the judges because we did not just throw ideas; we showed how to fix it, step by step.\n\nSo yes… we walked into a mess, chose the strongest thread, and pulled until the whole story made sense. That is how we landed second place at SABI Hackathon 2024, not by solving everything, but *by solving one thing really well*.\n\n",
    "facts": ["Event: SABI Hackathon", "Award: 2nd place", "Role: Analyst & presenter", "Judges: Accenture & DLS CSB"]
  },
  {
    "title": "NSTP 02 - AKAP sa Bata",
    "date": "2024",
    "image": "nstp.jpg",
    "tags": ["community", "teaching", "leadership"],
    "lede": "We were 13 students tasked to serve 150 people. In the chaos, I found clarity, and a calling to serve.",
    "body_md": "## What We Built\nWhen NSTP 02 was first introduced to us, I felt the weight of uncertainty. We were told we’d be catering to 50 children and 100 parents, yet we were only a class of just over 15 students, and soon, that number dropped to 13. On paper, we were outnumbered. But what I didn’t know then was that those 13 students would become one of the most passionate, driven, and collaborative groups I’d ever work with. And in that chaos, I would find clarity. Not just in what community service means, but in why I am placed here by Him.\n\nThe program's development was similar to building a house without a blueprint, operating on a limited budget, and relying heavily on intuition and experience. We initially thought about conducting a livelihood seminar on sewing, but I immediately challenged this. A sewing machine is expensive, and beyond the initial novelty of creating \"basahan,\" I worried it lacked lasting value, impact, and usefulness for the parents, especially since this is for their livelihood. I believed that to truly empower someone through business, they need to understand the fundamentals. It was not just about using items or tools, but also about understanding how to use them wisely. So I wanted to propose something simpler, practical, and scalable: costing, more specifically, the 3x rule in pricing. It was a concept I lived by as someone who ran a shoe store and managed a family hardware business in Davao. It was my way of saying, “This is how you begin.”\n\nBudgeting and logistics were, quite literally, intense. As the head of the finance committee, I was hyper aware of every peso spent. We had to stretch omelets in half to feed everyone. Yes, literally! With surgical gloves from the nurse beside us, we found ourselves dividing portions like a surgical team in an operating room. It was ridiculous, hilarious, and oddly beautiful. The little moments of joy amidst the chaos were my favorite part. The laughter over torn omelettes reminded me that even the most \"serious\" outreach programs have space for humanity, laughter, and moments that feel like little wonders.\nI truly believe that the parents of AKAP sa Bata were more than just an audience; they were individuals with dreams, worries, and families. I held a livelihood seminar for them, sharing how business doesn’t have to be overwhelming. I talked about momentum, starting small, walking before running, and the simplicity of the 3x pricing rule. I connected it to my own experiences. I once stumbled through pricing, shipping, and Alibaba forwarding/logistics until I found systems that worked. I wanted them to feel that this world, the world of business, isn’t exclusive or elite. It's something they can enter with excitement, passion, and faith.\n\nAnd to my surprise, they listened. Despite me being younger, they welcomed the knowledge. One parent even shared how she had given up on her business before because it was too time consuming, that it ate up time with her family. But after hearing my talk, she felt that maybe, just maybe, she could try again. That moment stayed with me. It made me realize that the simplest idea can spark the greatest impact.\n\nMy role wasn’t just finance. I was a storyteller, a strategist, and someone who tried to bring heart into every technical detail. I made sure we didn’t just buy things; we bought with purpose. I ensured that no effort was wasted, and even the way we fed our participants came from thoughtful planning. During the seminar, I poured out every business lesson I knew, hoping to bring hope in the minds of parents who had nearly given up.\n\nDespite our teacher being late, I’m just kidding haha! But in all seriousness, Sir Christian was a gift to our team. He guided us without caging us. He led with both professionalism and heart, playing Mobile Legends with us in the bus, even teaching us how to research better as he knew we had our thesis defense coming up, and giving us the freedom to explore ideas while quietly making impactful and powerful things happen behind the scenes. He found our speakers. He opened doors. And above all, he trusted us. That trust empowered us to dream bigger, work harder, and never lose the joy in what we were doing.\n\nI actually feel happy because I took this NSTP class again after failing my first attempt. This is because I didn’t just gain groupmates. I made friends, people I knew by name, whose faces I could smile at in the halls, on the streets, anywhere! NSTP became a space where connection flourished. We weren’t just fulfilling requirements; we were building something real. People like Kynna, Lycah, Luke, Tony, Angela, Skyler, Gavin, Jadon, Coby, Pau, Christian, and Ethan; they weren’t just classmates. They were my co dreamers.\n\nNSTP 02 wasn’t perfect, but it was powerful. It gave us the structure we needed to create something impactful, but it also allowed space for us to be creative, strategic, and most of all, human in the world He created. I wouldn’t change anything, because even the messy parts became meaningful.\n\nThis course made me feel rooted in something greater than myself. I used to think my skills were just for my own dreams, being a data scientist, a business owner, or a strategist. But NSTP showed me that the same skills can be used to lift others, to serve, to bless. Everyone in the group was significant. Each one had a strength, a story, a drive. But Sir Ranche, with his humility and belief in us, was our backbone. He didn’t just manage the course; he cultivated our growth.\n\nI gave my best in every phase. Be it planning, budgeting, or execution. I brought my business background and passion for storytelling into every step, especially the seminar. I felt like I was finally using my life experiences for a greater cause. I started to feel like His instrument.\n\nThis experience reflected Faith, as I surrendered the outcome to God and trusted in the value of kindness. It reflected Zeal for Service, as I gave my heart in a way that could lift others up. And most of all, it reflected Communion in Mission, as we walked together, 13 strong, toward one shared purpose. \n\nThe struggles we experienced in Akap sa Bata reminded me that poverty is not just material; it’s the lack of access, support, belief, and time. But when people are given tools, hope, and care, human dignity begins to rise again. I saw it happen in real time. The Philippines needs more programs like this: grounded, people first, sustainable. Service isn’t about saving; it’s about standing beside, equipping, and believing. I want to keep doing that.\n\nEverything I learned, I’ll carry forward. Whether it’s teaching business, building a company, or mentoring someone, I now know that even my smallest ideas can be someone’s breakthrough. NSTP showed me I don’t have to wait for success to serve; I can do it now.\n\nNSTP wasn’t just a subject. It was a reminder that in a world full of people waiting for miracles, sometimes we are the ones sent to be the miracles. Amidst all experiences, this thought recurs in my mind:\n\n\"Perhaps the very reason you are where you are, with all that you’ve gone through… is because God needed someone like you, right there, to be His instrument.\"\n\nAnd I say this now, with full certainty: “I’m Vin, and I’m happy to be His.”\n\n\n",
    "facts": ["Role: Finance head & livelihood speaker", "Focus: 3× pricing rule, simple startup economics", "Partner: AKAP sa Bata", "Outcome: Parents re-engaged with their small businesses"]
  }
]
